// 欧几里得算法求最大公约数, 分为辗转相除法与辗转相减法. 实际上辗转相减法是一种特殊的辗转相除法
// a % b == a - n * b (n == a / b)
// a - b == a - 1 * b
// 因此取模和相减本质相同


// 辗转相除法求正整数的最大公约数，其算法思想是：
// 不断检测除数和被除数能否整除，如果能整除则除数即是最大公约数，否则就更新被除数为除数，除数为上次的余数
// 数学表示为gcd(a, b) == gcd(a, a % b)

// 求m,n的最大公因数,要求m,n为正整数
int gcd(int m, int n)
{
    // 如果m小于n, 则交换使得m始终大于n
    if (m < n)
    {
        int t = m;
        m = n;
        n = t;
    }

    int r = 1;
    while (r = m % n) // 判断n对m是否能够整除(其中一个数字化为0)，并取得余数
    {
        m = n; // 被除数变为除数
        n = r; // 除数变为余数
    }

    return n;  // 非零数字即为最大公约数
}

// 辗转相减法求正整数的最大公约数, 其算法思想是:
// 两个数的最大公约数等于较小数和两数之差的最大公约数, 最终会得到两个相等的数, 即为最大公约数
// 数学表示为gcd(a, b) == gcd(a, a - b)

// 求m,n的最大公因数,m,n为正整数且m>n
int _gcd(int m, int n)
{
    int Q = m;
    int R = n;
    while (Q != R) // Q,R是否相等
    {
        // 若不相等, 则大减小, 最大公约数与之前相同
        if (Q > R)
            Q -= R;
        else
            R -= Q;
    }

    // 经过彼此相减两数最终相等, 则为最大公约数
    return Q;
}
